import Link from 'next/link';

import styles from './style.module.scss';

type Services = {
    title: string,
    link: string,
    desc: string
}

const items: Services[] = [
    {
        title: 'Подключение к сетям',
        desc: 'Заявление на технологическое присоединение объекта к системам водоснабжения / водоотведения',
        link: '/connection'
    },
    {
        title: 'Передача показаний через сайт',
        desc: 'Достаточно лишь заполнить несколько полей и подтвердить смс кодом',
        link: '/transmission-of-readings'
    },
    {
        title: 'Вызов контролёра',
        desc: 'Заполните заявку и контролер свяжется с вами для согласования времени',
        link: '/call-controller'
    },
    {
        title: 'Обращение в водоканал',
        desc: 'Официальное обращение в МУП "Находка-Водоканал" по любому вопросу',
        link: '/contact-us'
    },
]

export default function Services() {
    return (
        <section className={styles.services_section}>
            <div className={styles.services_grid}>
                {items.map((item, index) => (
                    <Link href={item.link} key={index} className={styles.service_card}>
                        <div className={styles.service_content}>
                            <div className={styles.service_image}>
                                <svg
                                    width="50"
                                    height="50"
                                    viewBox="0 0 60 60"
                                    className={styles.service_icon}
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    {index === 0 && (
                                        <>
                                            <rect width="60" height="60" rx="14" fill="currentColor" className={styles.svg_background} />
                                            <g clipPath="url(#clip0_102_434)">
                                                <g clipPath="url(#clip1_102_434)">
                                                    <g clipPath="url(#clip2_102_434)">
                                                        <path d="M36.1169 17.2479H23.97C22.834 17.2479 21.9601 16.21 21.9601 14.8608C21.9601 13.5115 22.834 12.4736 23.97 12.4736H36.1169C37.2529 12.4736 38.1268 13.5115 38.1268 14.8608C38.0394 16.21 37.1655 17.2479 36.1169 17.2479Z" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                        <path d="M17.9404 31.7783V23.579C17.9404 22.2298 18.8143 21.1919 19.9503 21.1919H21.9602V34.1654H19.9503C18.9017 34.1654 17.9404 33.1275 17.9404 31.7783Z" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                        <path d="M28.0773 23.3715V17.248H32.0097V23.3715" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                        <path d="M17.9403 24.9282H11.4736" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                                                        <path d="M11.4736 30.429H17.9403" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                                                        <path d="M42.0594 31.7783V23.579C42.0594 22.2298 41.1855 21.1919 40.0494 21.1919H38.0396V34.1654H40.0494C41.1855 34.1654 42.0594 33.1275 42.0594 31.7783Z" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                        <path d="M42.0593 24.9282H48.526" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                                                        <path d="M48.526 30.429H42.0593" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                                                        <path d="M33.4953 41.8457H26.5917C25.4556 41.8457 24.5818 40.8078 24.5818 39.4586V37.0714H35.5052V39.4586C35.5052 40.8078 34.544 41.8457 33.4953 41.8457Z" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                        <path d="M27.7278 41.8458V49.5261" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                                                        <path d="M32.3594 49.5261V41.8458" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                                                        <path d="M21.9601 32.0895H26.3295V37.0714" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                        <path d="M38.0394 23.3715H21.9601" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                        <path d="M33.6702 37.0714V32.0895H38.0395" stroke="white" strokeWidth="2.11728" strokeMiterlimit="10" strokeLinejoin="round" />
                                                    </g>
                                                </g>
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_102_434">
                                                    <rect width="39.699" height="39.699" fill="white" transform="translate(10.1504 11.1504)" />
                                                </clipPath>
                                                <clipPath id="clip1_102_434">
                                                    <rect width="39.699" height="39.699" fill="white" transform="translate(10.1504 11.1504)" />
                                                </clipPath>
                                                <clipPath id="clip2_102_434">
                                                    <rect width="39.699" height="39.699" fill="white" transform="translate(10.1504 11.1504)" />
                                                </clipPath>
                                            </defs>
                                        </>
                                    )}
                                    {index === 1 && (
                                        <>
                                            <rect y="0.963135" width="60" height="60" rx="14" fill="currentColor" className={styles.svg_background} />
                                            <g clipPath="url(#clip0_102_459)">
                                                <g clipPath="url(#clip1_102_459)">
                                                    <path d="M14.9125 15.8755H45.0875C46.0879 15.8755 47.0473 16.2729 47.7547 16.9803C48.4621 17.6876 48.8595 18.647 48.8595 19.6474V42.2787C48.8595 43.279 48.4621 44.2384 47.7547 44.9457C47.0473 45.6531 46.0879 46.0505 45.0875 46.0505H14.9125C13.9122 46.0505 12.9527 45.6531 12.2454 44.9457C11.538 44.2384 11.1406 43.279 11.1406 42.2787V19.6474C11.1406 18.647 11.538 17.6876 12.2454 16.9803C12.9527 16.2729 13.9122 15.8755 14.9125 15.8755ZM14.9125 19.6474V42.2787H28.1141V19.6474H14.9125ZM45.0875 42.2787V19.6474H42.749C43.2016 20.6658 43.1073 21.6653 43.1073 21.7785C42.9753 23.0421 42.0889 24.3622 41.7683 24.8337L37.3741 29.6428L43.6354 29.6051L43.6543 31.906L33.8473 31.8494L33.7719 29.9634C33.7719 29.9634 39.524 23.8719 39.8069 23.325C40.0709 22.7969 41.1459 19.6474 38.4868 19.6474C36.1671 19.7417 36.4311 22.0991 36.4311 22.0991L33.5268 22.1179C33.5268 22.1179 33.5456 20.8732 34.2434 19.6474H31.886V42.2787H36.7517L36.7328 40.6567L38.5622 40.6379C38.5622 40.6379 40.2784 40.3361 40.2973 38.6577C40.3727 36.7717 38.7697 36.7717 38.4868 36.7717C38.2416 36.7717 36.4688 36.866 36.4688 38.4125H33.6022C33.6022 38.4125 33.6776 34.5275 38.4868 34.5275C43.3902 34.5275 43.1262 38.337 43.1262 38.337C43.1262 38.337 43.2016 40.6945 41.0328 41.5808L42.0135 42.2787H45.0875ZM24.1914 38.5067H21.3624V27.5683L17.9678 28.6244V26.3047L23.8896 24.1925H24.1914V38.5067Z" fill="white" />
                                                </g>
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_102_459">
                                                    <rect width="45.9092" height="45.9092" fill="white" transform="translate(7.04541 8.00854)" />
                                                </clipPath>
                                                <clipPath id="clip1_102_459">
                                                    <rect width="45.9092" height="45.9092" fill="white" transform="translate(7.04541 8.00854)" />
                                                </clipPath>
                                            </defs>
                                        </>
                                    )}
                                    {index === 2 && (
                                        <>
                                            <rect width="60" height="60" rx="14" fill="currentColor" className={styles.svg_background} />
                                            <g clipPath="url(#clip0_102_469)">
                                                <path d="M21.2039 19.0721C21.896 16.8916 23.6458 15.088 25.9469 14.1V16.8278C25.9469 17.0965 26.0537 17.3542 26.2437 17.5443C26.4337 17.7343 26.6914 17.841 26.9602 17.841C27.2289 17.841 27.4866 17.7343 27.6766 17.5443C27.8667 17.3542 27.9734 17.0965 27.9734 16.8278V12.7747C27.9734 12.506 28.0802 12.2483 28.2702 12.0583C28.4602 11.8682 28.7179 11.7615 28.9867 11.7615H31.0132C31.2819 11.7615 31.5396 11.8682 31.7296 12.0583C31.9197 12.2483 32.0265 12.506 32.0265 12.7747V16.8278C32.0265 17.0965 32.1332 17.3542 32.3232 17.5443C32.5132 17.7343 32.7709 17.841 33.0397 17.841C33.3084 17.841 33.5662 17.7343 33.7562 17.5443C33.9462 17.3542 34.0529 17.0965 34.0529 16.8278V14.1C36.3875 15.1022 38.1536 16.9423 38.8254 19.1653C38.565 19.3761 38.1303 19.6314 37.4524 19.8787C35.9406 20.4298 33.4045 20.8808 29.4669 20.8808C26.6308 20.8808 24.3521 20.439 22.8139 19.8777C22.0722 19.6071 21.5392 19.3214 21.2039 19.0721Z" fill="white" />
                                                <path fillRule="evenodd" clipRule="evenodd" d="M38.1466 21.7826C39.0434 21.4543 39.7506 21.0612 40.2532 20.6092C40.8277 21.1594 41.1459 21.7643 41.1459 22.4007C41.1459 23.6145 39.9867 24.718 38.096 25.5347C38.1509 26.6319 37.9822 27.7289 37.6001 28.7589C37.218 29.789 36.6306 30.7306 35.8734 31.5266C35.1163 32.3226 34.2052 32.9564 33.1955 33.3895C32.1859 33.8226 31.0987 34.0459 30.0001 34.0459C28.9014 34.0459 27.8143 33.8226 26.8047 33.3895C25.795 32.9564 24.8839 32.3226 24.1268 31.5266C23.3696 30.7306 22.7821 29.789 22.4 28.7589C22.018 27.7289 21.8493 26.6319 21.9041 25.5347C20.0134 24.718 18.8542 23.6145 18.8542 22.4007C18.8542 21.742 19.1947 21.1169 19.8077 20.5525L19.9222 20.6437C20.4734 21.0703 21.2273 21.4563 22.121 21.7816C23.9155 22.4372 26.4364 22.9073 29.4671 22.9073C33.5282 22.9073 36.3258 22.4463 38.1466 21.7826ZM23.9266 26.2247C23.9966 27.7885 24.667 29.265 25.7984 30.3468C26.9297 31.4286 28.4347 32.0324 30.0001 32.0324C31.5654 32.0324 33.0704 31.4286 34.2018 30.3468C35.3331 29.265 36.0035 27.7885 36.0735 26.2247C34.3267 26.6908 32.2394 26.9603 30.0001 26.9603C27.7608 26.9603 25.6735 26.6898 23.9266 26.2247ZM11.7615 48.2387H33.0398V36.5862L31.0133 38.1061V42.0548C30.6812 42.1313 30.3409 42.1664 30.0001 42.1592C29.5188 42.1592 29.1945 42.1085 28.9868 42.0548V38.3311L24.2782 34.6692C18.3679 35.804 11.7615 38.4486 11.7615 42.1592V48.2387ZM18.8542 46.2122H26.9603V41.3283L20.3488 42.4307L22.2497 37.2043C21.098 37.5005 19.9644 37.8625 18.8542 38.2885V46.2122ZM13.788 46.2122H16.8278V39.1995L16.7527 39.239C15.6747 39.8104 14.8864 40.3931 14.3898 40.9412C13.9035 41.4803 13.788 41.8785 13.788 42.1592V46.2122Z" fill="white" />
                                                <path d="M38.6837 31.672C39.2694 31.0742 40.082 31.677 39.9037 32.4948L39.8773 32.6143C39.7862 33.0311 39.7897 33.463 39.8875 33.8782C39.9852 34.2934 40.1748 34.6814 40.4424 35.0138C40.7099 35.3461 41.0485 35.6142 41.4333 35.7984C41.818 35.9826 42.2392 36.0783 42.6658 36.0783C43.0924 36.0783 43.5136 35.9826 43.8984 35.7984C44.2831 35.6142 44.6217 35.3461 44.8892 35.0138C45.1568 34.6814 45.3464 34.2934 45.4442 33.8782C45.5419 33.463 45.5454 33.0311 45.4543 32.6143L45.428 32.4948C45.2496 31.677 46.0623 31.0751 46.6479 31.6729C47.6693 32.7135 48.2407 34.1139 48.2387 35.572C48.2393 36.5171 47.9994 37.4468 47.5415 38.2735C47.0836 39.1003 46.4229 39.7969 45.6215 40.2978C45.3388 40.4741 45.199 40.8125 45.199 41.1459V46.2122C45.199 46.7496 44.9854 47.2651 44.6054 47.6452C44.2253 48.0252 43.7099 48.2387 43.1724 48.2387H42.1592C41.6217 48.2387 41.1063 48.0252 40.7262 47.6452C40.3462 47.2651 40.1327 46.7496 40.1327 46.2122V41.1459C40.1327 40.8125 39.9929 40.4741 39.7102 40.2978C38.9086 39.7968 38.2477 39.1001 37.7899 38.2731C37.332 37.4461 37.0921 36.5162 37.0929 35.571C37.0929 34.0531 37.6999 32.6761 38.6837 31.672Z" fill="white" />
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_102_469">
                                                    <rect width="49.3311" height="49.3311" fill="white" transform="translate(5.33447 5.33447)" />
                                                </clipPath>
                                            </defs>
                                        </>
                                    )}
                                    {index === 3 && (
                                        <>
                                            <rect width="60" height="60" rx="14" fill="currentColor" className={styles.svg_background} />
                                            <g clipPath="url(#clip0_102_481)">
                                                <path d="M15.4519 17.549H44.548V39.3711H17.5795L15.4519 41.4988V17.549ZM15.4519 13.912C13.4515 13.912 11.833 15.5486 11.833 17.549L11.8148 50.2822L19.0889 43.0082H44.548C46.5485 43.0082 48.1851 41.3715 48.1851 39.3711V17.549C48.1851 15.5486 46.5485 13.912 44.548 13.912H15.4519ZM19.0889 32.0971H40.911V35.7341H19.0889V32.0971ZM19.0889 26.6416H40.911V30.2786H19.0889V26.6416ZM19.0889 21.186H40.911V24.823H19.0889V21.186Z" fill="white" />
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_102_481">
                                                    <rect width="44.2678" height="44.2678" fill="white" transform="translate(7.86609 9.96313)" />
                                                </clipPath>
                                            </defs>
                                        </>
                                    )}
                                </svg>
                            </div>
                            <h3 className={styles.service_title}>{item.title}</h3>
                            <p className={styles.service_desc}>{item.desc}</p>
                            <div className={styles.service_arrow}>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5 12H19M19 12L12 5M19 12L12 19" stroke="currentColor" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round" />
                                </svg>
                            </div>
                        </div>
                    </Link>
                ))}
            </div>
        </section>
    )
}